---
kind: other
id: Properties.T:Autodesk.Revit.DB.EditScope
source: html/0dec7626-b882-32b3-1a5a-c35f46c6b500.htm
---
# EditScope Properties

Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet.